Rendering library has not been installed, so the third party geometry cannot be created.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RenderLibNotInstalledWarn { get; }
  Visual Basic
Public Shared ReadOnly Property RenderLibNotInstalledWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RenderLibNotInstalledWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RenderFailures Class
  Autodesk.Revit.DB Namespace